; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-1-1-3-2-2-6) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - Crate
	hoist0 hoist1 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 distributor0)
	(clear crate4)
	(at truck0 distributor0)
	(at truck1 distributor0)
	(at truck2 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(at crate2 depot0)
	(on crate2 crate0)
	(at crate3 distributor0)
	(on crate3 crate1)
	(at crate4 distributor0)
	(on crate4 crate3)
	(at crate5 depot0)
	(on crate5 crate2)
)

(:goal (and
		(on crate0 pallet0)
		(on crate3 crate5)
		(on crate4 pallet1)
		(on crate5 crate0)
	)
))

; plan
1. (lift hoist0 crate5 crate2 depot0)
   deleted: (at crate5 depot0) (available hoist0) (on crate5 crate2) (clear crate5)
   added: (lifting hoist0 crate5) (clear crate2)
   goals met: 1 of 4
2. (load hoist0 crate5 truck2 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck2) (available hoist0)
   goals met: 1 of 4
3. (lift hoist0 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (available hoist0) (on crate2 crate0) (clear crate2)
   added: (lifting hoist0 crate2) (clear crate0)
   goals met: 1 of 4
4. (load hoist0 crate2 truck2 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck2) (available hoist0)
   goals met: 1 of 4
5. (unload hoist0 crate5 truck2 depot0)
   deleted: (available hoist0) (in crate5 truck2)
   added: (lifting hoist0 crate5)
   goals met: 1 of 4
6. (lift hoist1 crate4 crate3 distributor0)
   deleted: (at crate4 distributor0) (available hoist1) (on crate4 crate3) (clear crate4)
   added: (lifting hoist1 crate4) (clear crate3)
   goals met: 1 of 4
7. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 1 of 4
8. (lift hoist1 crate3 crate1 distributor0)
   deleted: (at crate3 distributor0) (available hoist1) (on crate3 crate1) (clear crate3)
   added: (lifting hoist1 crate3) (clear crate1)
   goals met: 1 of 4
9. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 1 of 4
10. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (available hoist1) (on crate1 pallet1) (clear crate1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 1 of 4
11. (drop hoist0 crate5 crate0 depot0)
   deleted: (lifting hoist0 crate5) (clear crate0)
   added: (at crate5 depot0) (available hoist0) (on crate5 crate0) (clear crate5)
   goals met: 2 of 4
12. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 2 of 4
13. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   goals met: 2 of 4
14. (unload hoist0 crate3 truck0 depot0)
   deleted: (available hoist0) (in crate3 truck0)
   added: (lifting hoist0 crate3)
   goals met: 2 of 4
15. (drop hoist0 crate3 crate5 depot0)
   deleted: (lifting hoist0 crate3) (clear crate5)
   added: (at crate3 depot0) (available hoist0) (on crate3 crate5) (clear crate3)
   goals met: 3 of 4
16. (unload hoist1 crate4 truck1 distributor0)
   deleted: (available hoist1) (in crate4 truck1)
   added: (lifting hoist1 crate4)
   goals met: 3 of 4
17. (drop hoist1 crate4 pallet1 distributor0)
   deleted: (lifting hoist1 crate4) (clear pallet1)
   added: (at crate4 distributor0) (available hoist1) (on crate4 pallet1) (clear crate4)
   goals met: 4 of 4
